app/controllers/exams_controller.rb

SELECT "exams".* FROM "exams" WHERE (expires_on > '2015-06-15 00:18:03.010826')
---
  def index
    @exams = Exam.all

SELECT "exams".* FROM "exams" WHERE (user_id = 2)
---
  def user_exams_index
    @exams = Exam.where("user_id = ?", current_user.id)

INSERT INTO "exams" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Examen Parcial I"], ["created_at", "2015-06-14 02:55:50.114541"], ["updated_at", "2015-06-14 02:55:50.114541"]]
---
  def create
    @exam = Exam.new(exam_params)

    respond_to do |format|
      if @exam.save

DELETE FROM "exams" WHERE "exams"."id" = ?  [["id", 1]]
---
  def destroy
    @exam.destroy

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_exam
      @exam = Exam.find(params[:id])