app/controllers/item_answers_controller.rb

INSERT INTO "item_answers" ("correct", "created_at", "updated_at") VALUES (?, ?, ?)  [["correct", "t"], ["created_at", "2015-06-14 02:55:50.222809"], ["updated_at", "2015-06-14 02:55:50.222809"]]
---
  def create
    @item_answer = ItemAnswer.new(item_answer_params)

    respond_to do |format|
      if @item_answer.save

DELETE FROM "item_answers" WHERE "item_answers"."id" = ?  [["id", 1]]
---
  def destroy
    @item_answer.destroy

SELECT  "item_answers".* FROM "item_answers" WHERE "item_answers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_item_answer
      @item_answer = ItemAnswer.find(params[:id])