app/controllers/items_controller.rb

  def index
    @exam = Exam.find(params[:exam_id])
---
SELECT  "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("question", "created_at", "updated_at") VALUES (?, ?, ?)  [["question", "Pregunta #1"], ["created_at", "2015-06-14 02:55:50.314323"], ["updated_at", "2015-06-14 02:55:50.314323"]]