app/controllers/solved_exams_controller.rb

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", 3]]
SELECT "solved_exams".* FROM "solved_exams" WHERE (user_id = 2 AND finished = 'f')
---
  def index
    state = params[:state].eql?("True")
    @solved_exams = SolvedExam.where("user_id = ? AND finished = ?", current_user.id, state)

INSERT INTO "solved_exams" ("score", "created_at", "updated_at") VALUES (?, ?, ?)  [["score", 80], ["created_at", "2015-06-14 02:55:50.398744"], ["updated_at", "2015-06-14 02:55:50.398744"]]
---
  def create
    @solved_exam = SolvedExam.new(solved_exam_params)
    @solved_exam.save

SELECT  "solved_exams".* FROM "solved_exams" WHERE "solved_exams"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    se = SolvedExam.find(params[:id])

DELETE FROM "solved_exams" WHERE "solved_exams"."id" = ?  [["id", 1]]
---
  def destroy
    @solved_exam.destroy

SELECT  "solved_exams".* FROM "solved_exams" WHERE "solved_exams"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_solved_exam
      @solved_exam = SolvedExam.find(params[:id])