app/views/solved_exams/index.html.haml

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", 3]]
---
- @solved_exams.each do |solved_exam|
  .row
    .col-md-12.exam-box
      .row
        .col-md-4

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
              Creado por:
              = User.find(exam.user_id).fullname
        .col-md-2