app/views/exams/index.html.haml

%label{id: 'user-id-label', user_id: current_user.id}
- @exams.each do |exam|
  .row
    .col-md-12.exam-box
      .row
        .col-md-4
---
SELECT "exams".* FROM "exams" WHERE (expires_on > '2015-06-15 00:18:03.010826')

              Creado por:
              = User.find(exam.user_id).fullname
        .col-md-2
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

            - if current_user.id != exam.user_id
              - se = SolvedExam.where(['exam_id = ? and user_id = ?', exam.id, current_user.id])
---
SELECT  "solved_exams".* FROM "solved_exams" WHERE (user_id = 2 AND exam_id = 1)  ORDER BY "solved_exams"."id" ASC LIMIT 1