app/views/exams/user_exams_index.html.haml

- @exams.each do |exam|
  .row.exam-box
    .col-md-8.info
---
SELECT "exams".* FROM "exams" WHERE (user_id = 2)

        Creado por:
        = User.find(exam.user_id).fullname
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]